Repository: maabou512/ospo_paper2021
Catalog: LFResearch_OSPO_Report Folder/omegaT_Rainbow/pack1/pack1-level2.tmx
Source language: en_us
Languages: ja_jp

source: (A more detailed and granular archetype study would benefit the OSPO movement).
ja_jp: （より詳細で粒度の細かい「原型」の調査が、 OSPO の進展に恩恵をもたらすものとなるでしょう。）

source: 1,000s
ja_jp: 数千人

source: 100s
ja_jp: 数百人

source: 19% said they have never heard of OSPOs.
ja_jp: 19%が OSPO について聞いたことがないと回答

source: 2 years
ja_jp: 2年

source: 24 and Sept.
ja_jp: 2021年8月24日、および

source: 28% said they see no business value in OSPOs.
ja_jp: 28%が OSPO にビジネス価値はないと回答

source: 35% of organizations that have no OSPO said they haven’t considered opening one.
ja_jp: OSPO を持たない組織の35%が、OSPO を立ち上げることを考えていないと回答

source: 5 years
ja_jp: 5年

source: 9 years
ja_jp: 9年

source: Spurred by the rapid growth of Tesla and its software-first automotive technology development approach, Volkwagen has created a number of initiatives to accelerate the internal creation of software, as well as participation in open source communities and projects.
ja_jp: Tesla の急速な成長と彼らの「ソフトウェア ファースト」な自動車技術開発のアプローチに刺激された Volkswagen グループは、ソフトウェアの内製 を加速する多くのイニシアチブを、オープンソース コミュニティやプロジェクトへの参加と併せて作り出しました。

source: First coined by publisher and technology venture capitalist Tim O’Reilly in 2000, the term inner source has come to describe collaborative innovation efforts inside companies that mimic some, but not all, of the characteristics of classic OSS communities.
ja_jp: 2000年に 出版社とテック系ベンチャーキャピタリストの Tim O’Reilly によって最初に作られた用語「インナーソース」は、古典的なOSSコミュニティがもつ特徴のすべてではなく一部を模倣した、企業内におけるコラボレーティブなイノベーションの取り組みを指すようになりました。

source: TODO is an open group of 70+ organizations with years of experience running open source programs that want to collaborate on practices, tools, and other ways to run successful and effective open source projects and programs.
ja_jp: TODO グループ は、オープンソースプログラムの実行に長年の経験を持つ70以上の組織からなるオープンなグループです。オープンソース プロジェクトやプログラムが成果を出し、かつ実効的なものとなるよう、プラクティスやツール、その他手法においてコラボレーションすることを目指しています。

source: See, for example, Robert W. Hahn, “Government Policy toward Open-Source Software: An Overview,” Government Policy Toward Open-Source Software, Brookings Institution Press and American Enterprise Institute, 31 Dec.
ja_jp: 例えば次を参照されたし。Robert W. Hahn, “Government Policy toward Open-Source Software: An Overview,” Government Policy Toward Open-Source Software, Brookings Institution Press and American Enterprise Institute、

source: Comcast uses open source to help build some of the primary infrastructure services that powers its products and services.
ja_jp: Comcast はオープンソースを使用し、同社の製品やサービスを支えるための主要なインフラサービスを構築しています。

source: Jim Zemlin Executive Director, The Linux Foundation
ja_jp: Jim Zemlin エグゼクティブ ディレクター、The Linux Foundation

source: The rise of the OSPO roughly mirrors the proliferation of OSS to build and run the most important technology applications within organizations in the world today.
ja_jp: OSPO の興隆は、今日の世界中の組織内で、最も重要となる技術を構築し、稼働させるために OSS（の活用）が急増していることを概ね反映しています。

source: The storied automaker is driving rapidly towards an open source future.
ja_jp: 広く語られるこの自動車メーカーは、オープンソースの未来に向かって急速な「ドライブ」をしています。

source: This report is licensed under the Creative Commons Attribution-NoDerivatives 4.0 International Public License.This material may be copied and distributed under the terms of the Creative Commons license.
ja_jp: 本レポートは、 <g2Creative Commons Attribution-NoDerivatives 4.0 International Public License の下で許諾されます。本資料は、Creative Commons Licenseの条件の下で複製および配布することができます。

source: While OSS users have always considered legal compliance, some OSS contributors have designed new licenses to discourage large cloud providers from creating proprietary services based on open source projects.
ja_jp: OSS ユーザーの人たちはいつも法令遵守を考慮してきたのですが、一部の OSS コントリビューターたちは、大規模クラウドプロバイダがオープンソースプロジェクトに基づいてプロプライエタリなサービスを作成することを思いとどまらせるべく、新しいライセンスをデザインしてきました。

source: “My vision is to be strategic to the company as an OSPO and enable the business to better achieve its goals through OSS.
ja_jp: 「私のビジョンは、OSPOとして会社にとって戦略的な存在となり、OSSを通じて ビジネスのゴールがをよりよい形で達成することを可能にする存在になることです。

source: Technology companies active in open source may extend education programs to customers who want to interact with OSS communities and vendors.
ja_jp: オープンソースに積極的なテック企業は、OSS コミュニティやベンダーとの交流を望む顧客に対して教育プログラムを拡張して提供するのかもしれません。

source: https://www.brookings.edu/wp-content/uploads/2016/07/governmentpolicytowardopensourcesoftware_chapter.pdf, accessed 19 Oct.
ja_jp: https://www.brookings.edu/wp-content/uploads/2016/07/governmentpolicytowardopensourcesoftware_chapter.pdf, 、

source: https://www.synopsys.com/software-integrity/resources/analyst-reports/open-source-security-risk-analysis.html, accessed Jan.
ja_jp: https://www.synopsys.com/software-integrity/resources/analyst-reports/open-source-security-risk-analysis.html 、

source: A well-designed OSPO is the center of competency for an organization’s open source operations and structure.
ja_jp: よくデザインされた OSPO は中核的存在となり、組織としてのオープンソースの運用や構造の「コンピテンシー」になっていきます。

source: A company might use OSS released under the terms of this license to deliver proprietary software-as-a-service (SaaS) to its customers, but the creator of the OSS might have grounds to sue the company for license violation if the AGPL terms do not clearly distinguish between internal and external delivery.
ja_jp: このライセンスの条項に基づきリリースされた OSSをある企業が使用し、プロプライエタリな SaaS（Software-as-a-Service） を顧客に提供する可能性がありますが、AGPL の条項で内部向けのデリバリと外部向けのデリバリを明確に区別できない場合、そのOSSの作成者はその企業をライセンス違反で訴訟する 根拠を持つ可能性があります。

source: A few years into Fleming’s tenure, the person in charge of technology events left the company, and Fleming arranged to move that responsibility over to the OSPO.
ja_jp: Fleming がきて数年後、技術イベントの責任者が退職したことをうけ、Fleming はその責務を OSPO へと移管することにしました。

source: A key job for many OSPOs today is helping the company and its technology teams to prioritize OSS consumption and make open source the first choice by default for any technology initiative.
ja_jp: 今日、多くの OSPO にとって大事な仕事は、自社技術チームが OSS の使用を優先させ、あらゆる技術的なイニシアチブに対しデフォルトで、そして最初にオープンソースを選択するよう支援することです。

source: A lot of us understand that publishing code as open source is not turning a code switch and saying, “Hey, we are done here.” Doing this in a responsible and meaningful way is helping to create and support a community and making the code accessible to others.
ja_jp: 私たちは、オープンソースとしてコードを公開するということが、コードを公開用にして、「ここに置いといたよ」といえば済むような話ではないことを理解しています。責任があり、意味のあるやり方でこれを実践することがコミュニティを生み出し、サポートすること、コードへ他の人たちがアクセスできるようにすることに役立っていくのです。

source: A question that often comes up is, what are the various archetypes of OSPOs and how do they differ?
ja_jp: さまざまある OSPO の「原型（Archetypes）」（OSPOを特徴づけているもの）にはどのようなものがあるか？ それぞれにどのような違いがあるのか？というのはよくある質問です。

source: A sub-archetype is the technology company that depends heavily on OSS and must design to meet OSS community needs.
ja_jp: したがって、OSS に大きく依存し、OSS コミュニティのニーズを満たすように設計しなければならない「テック企業」は副次的な原型（Sub-archetype）となります。

source: A third type of guidance is helping organizations understand and navigate project politics, such as maintaining a neutral stance when multiple influential actors are attempting to steer a project, or illuminating the latent political considerations of community members.
ja_jp: ガイダンスの3番目のタイプでは、組織がプロジェクトの政治を理解し、切り抜けていくことを支援します。例えば、多くの点で影響力がある関係者がプロジェクトを運営しようとする場合に中立な立場を維持することや、コミュニティメンバーが見せていない政治的考えを明らかにすることなど、がそれにあたります。

source: About Open Source at Comcast
ja_jp: Comcast におけるオープンソース

source: About Open Source at Porsche
ja_jp: Porsche におけるオープンソースについて

source: According to Ambiel of VMware:
ja_jp: VMware の Ambiel はこう言います。

source: According to Deborah Bryant of Red Hat, her OSPO has had to manage the cost of participating in open source foundation work, between sponsoring and dedicating staff to fill leadership roles.
ja_jp: Red Hat の Deborah Bryant によると、彼女のいる OSPO はオープンソースの財団での活動へ参加するために、コストをマネージ ― リーダーシップを発揮する上でスポンサリングするのがいいのか、スタッフ専任させるのがいいのか ― しなければなりませんでした。

source: Acknowledgments
ja_jp: 謝辞（Acknowledgments）

source: Acknowledgments 31
ja_jp: 謝辞 31

source: Advise the CTO and technology leadership on which open source technologies to adopt or remove from the organization’s technology stack
ja_jp: どういったオープンソースの技術を採用するべきか、もしくは自組織の技術スタックから取り除くべきか、について CTO や技術リーダーに助言する

source: After organizations recognize the value of OSS and the need for compliance, education, and an SBOM, they begin to realize the economic benefits of OSS usage and seek to expand it.
ja_jp: OSSの価値やコンプライアンス、教育、SBOM といったことの必要性を組織が認識するようになると、その次に組織は OSS の使用による経済的なメリットを実現し、それを広げようとし始めます。

source: Against this backdrop, initial organizational efforts focused on making sure that developers were complying with open source licenses and keeping inventory of OSS in use.
ja_jp: こういった状況での当初の組織的取り組みとしては、開発者たちによるオープンソースライセンスの準拠と、使用しているOSSの棚卸しを確実にすることに焦点を当てていました。

source: All are encouraging their employees to contribute to open source projects that are strategic to their business and security.
ja_jp: こういった企業すべてが、自社ビジネスやセキュリティと照らし合わせ戦略性を有するオープンソース プロジェクトへコントリビュートすることを社員たちに奨励しているのです。

source: Alyssa Wright (OSPO, Bloomberg), Zoom interview with author, Sept.
ja_jp: Alyssa Wright （OSPO、Bloomberg）、著者によるZoomインタビュー、

source: An OSPO maturity model featuring case studies from Bloomberg, Comcast, and Porsche
ja_jp: Bloomberg、Comcast、Porsche 各社ケーススタディから見るOSPOの成熟モデル

source: An OSPO which its members may act as internal consultants to help developers and teams better understand, interact with, consume, and plan around open source technologies
ja_jp: 開発者やチームがオープンソース技術をよりよく理解し、連携し、使用し、計画するのを支援するために、メンバーが社内コンサルタントとして活動するOSPO

source: An organization’s legal team or technology leaders tend to launch Stage 1 development of an OSPO to ensure that its employees (and contractors, suppliers, etc.) all use OSS according to its license terms and that the organization’s OSS consumption is not putting it at legal risk.
ja_jp: 組織の法務チームまたは技術リーダーは、従業員（および外注先、サプライヤなど含む）全員がライセンス条項に従って OSS を使用し、かつ組織の OSS の消費で法的リスクにさらされていない、ということを確実にする目的で、OSPOのステージ1の開発を始める傾向があります。

source: Another quipped: We do, and it is: No open source.
ja_jp: するともう一人が皮肉っぽく言いました：「いやあるよ。でも、それがオープンソースになってないんだよ。」

source: Are there processes or best practices?” Recently, the OSPO guided the Trickster and Kuberhealthy maintainers toward contributing the projects to the Cloud Native Computing Foundation.
ja_jp: プロセスとかやベストプラクティスはある？』最近、このOSPOは、Trickster や Kuberhealthy のメンテナーたちに Cloud Native Computing Foundation （CNCF）のプロジェクトにコントリビューションするようガイドしました。

source: As OSPOs have proliferated and become more common, these programs have matured.
ja_jp: OSPO が広まり、より一般的なものになるにしたがい、これらのプログラムが成熟してきました。

source: As a project changes licenses away from OSI-approved licenses to their own license types, we may not be able to contribute to those projects anymore, as they are no longer true [OSS].
ja_jp: プロジェクトがライセンスを OSI 承認ライセンス（OSI-approved license）から独自のライセンスタイプへ変更してしまうと、それらはもはや真の OSS ではないので、私たちはそれらのプロジェクトにコントリビュートできなくなるかもしれません。

source: As an OSS organization matures, its OSPO develops internal proc esses, playbooks, checklists, tooling, and other mechanisms to vet, organize, and operate open source projects and to prepare and coach their leaders.
ja_jp: OSS な組織として成熟してくるとその組織の OSPO はオープンソース プロジェクトを把握し、まとめ、運用していくための内部プロセス 、プレイブック、チェックリスト、ツールやその他の仕組みを整備し、そしてそ先を見据えそのリーダーたちをコーチします。

source: As an organization with advanced legal thinking, Bloomberg had defined policies around open source compliance and consumption, but the existing policies were designed to govern internal consumption.
ja_jp: 高度なリーガル思考を有する組織として、Bloomberg はオープンソースのコンプライアンスや使用に関するポリシーを定義してきましたが、その既存ポリシーは社内使用のガバナンスのためにデザインされたものでした。

source: As more and more people from management down to individual contributors understood that we wanted to build better relationships and broaden engagement and usage of open source, we became advisors in strategic decision-making.
ja_jp: マネジメントから個人のコントリビューターに至るまで、「自分たちはオープンソースについてよい関係を構築したいんだ、使用やエンゲージメントをもっと広げていきたいんだ。」と、だんだん多くの人たちが思うようになってきたことで、私たちは戦略的な意思決定におけるアドバイザーになったのです。

source: As open source became more important to Comcast’s business and technology strategies, the company recognized it needed to move to a more mature stage, one of collaboration and community leadership, to build a cohesive internal and external open source strategy.
ja_jp: オープンソースは、Comcast のビジネスと技術戦略にとってより重要なものとなるにつれて、同社は、社内と社外が強く結束するオープンソース戦略を構築するべく、より成熟した段階 ― 「コラボレーションとコミュニティのリーダーシップ」の段階 ― へと移行し、必要があることを認識しました。

source: As part of the process, we conducted three case studies of the evolution of three OSPOs in three different sectors—media, financial services, and transportation—each case structured as a journey through the stages of the OSPO.
ja_jp: この作業過程において、私たちは OSPO の進化に関する3つの異なる業種でのケーススタディを行いました。それぞれのケースが、メディア、金融サービス、輸送、各業種での OSPO の各段階を歩む「旅」として構成されています。

source: As part of this effort, Porsche created its own OSPO in 2020.
ja_jp: この取り組みの一環として、Porsche は2020年に自社 OSPO を立ち上げました。

source: As the first OSPO hire in the company’s CTO Office, Fleming was tasked with creating an OSPO from scratch to help unlock open source for a company that had traditionally treated all code like many other organizations—as intellectual property that it had to protect.
ja_jp: 同社 CTO オフィスで初めての OSPO として採用された Fleming は、これまですべてのコードを他の多くの組織と同じように ― 守るべき知的財産として ― 扱ってきた企業がオープンソースを「解錠（Unlock）」することを支援すべく、ゼロから OSPO を作り上げるタスクを任せられたのです。

source: As the number of respondents to the OSPO survey expanded significantly in 2021, the composition of the survey respondents shifted to reflect the general economy, not just technology (although responses remain technology-heavy).
ja_jp: 2021年においてこの「OSPO サーベイ」の回答者数が大幅に増加するにしたがい、調査回答者の構成がテック企業だけでなく経済界全体を反映されるようにシフトしてきています(ただし、回答は依然としてテック企業に偏る傾向にあります)。

source: As the office has grown, the Comcast open source team has branched out into new areas, creating an internal open source ambassador program to scale education about open source best practices and creating an inner source practice to share development burdens across multiple business units.
ja_jp: OSPO が成長するにつれて、Comcast のオープンソース チームは新しい領域へ歩みを広げていきました。オープンソースのベストプラクティスに関する教育をスケールさせるための社内オープンソース アンバサダー プログラムや、複数ビジネスユニット間で開発の負担を共有するためのインナーソース プラクティスを作り上げました。

source: As the world shifts from proprietary software and toward open source everywhere, the role of the OSPO will grow in importance.
ja_jp: 世界がプロプライエタリ ソフトウェアからオープンソース ソフトウェアへとシフトするにつれ、OSPOの役割は今後ますます重要になっていきます。

source: As they advance in Stage 2, organizations begin incentivizing their developers to work on OSS projects critical to their operations, to the degree that developers become highly active contributors or primary maintainers.
ja_jp: ステージ2の段階を進んでいくにつれ、組織は自社の経営にとって重要不可欠な OSS プロジェクトに開発者たちが取り組み、非常に活動的なコントリビューターや主要なメンテナーになれるレベルを目指せるよう、インセンティブを与え始めます。

source: At Stage 3, organizations initiate and then host or act as primary sponsors of OSS projects.
ja_jp: ステージ3では、組織がOSSプロジェクトを1から立ち上げ、その後それをホスト役や主要スポンサーとして活動します。

source: At Stage 4, the CTO and other technology leaders consult the OSPO and its leadership on which open source technologies to rely on and which decision criteria to use in judging open source projects.
ja_jp: ステージ4では、CTO をはじめとする技術リーダーたちが、どういったオープンソース技術にたよるべきか、どういった判断基準をオープンソース プロジェクトの審査において用いるべきか、といったことついて、OSPO やそのリーダーたちと協議します。

source: At a higher plane, OSPOs can help companies maintain a neutral posture on techno-nationalism and bridge political differences by cultivating personal and working relationships that transcend national boundaries and political realms.
ja_jp: より高いレベルでは、OSPO は企業が「テクノナショナリズム」に中立的な姿勢を維持し、国境や政治的領域を越えた人的、実務的な関係を育むことで、政治的な違いの橋渡しすることを支援します。

source: At one point we decided that because we do consume a lot of open source, we needed an overarching cross-functional team,” says Nik Peters, Head of the Open Source Program Office at Porsche.
ja_jp: 多くのオープンソースを使用していることから、私たちはあるタイミングで包括的で機能横断的なチームが必要だと判断しました。」と、Porsche のオープンソース プログラムオフィスの長である Nik Peters は述べています。

source: At the same time, Porsche and VW wanted to improve collaborative development efforts and make that a greater part of their technology development approach.
ja_jp: 同時に、Porsche と VW グループはコラボレーション開発の取り組みを改良し、それを彼らの技術開発のアプローチのより重要な領域にしたいと考えました。

source: At this early stage, organizations often use many different names for the OSPO.
ja_jp: この初期の段階では、組織はしばしば OSPO に対しいろいろな名称を用います。

source: At this maturity stage, the OSPO becomes a strategic partner for technology decisions, helping to guide choices and shape long-term commitments to projects.
ja_jp: この成熟段階では、OSPO は技術的な決定に対する戦略的パートナーとなり、プロジェクトへの長期的なコミットメントの選択や形成へ導く手助けをするようになります。

source: At this point, the OSPO communicates to employees and managers the importance of contributing to and not merely consuming OSS.
ja_jp: またこの段階において、OSPO は社員や管理者に向け、OSS の単なる消費でなく、OSS へのコントリビューションの重要性も伝えるようになります。

source: At this stage, organizations turn to OSPOs for guidance on how to engage positively with open ecosystems.
ja_jp: このステージの段階では、組織はオープンなエコシステムに積極的にエンゲージするやり方についてのガイダンスをOSPOに頼るようになります。

source: Attract and retain high quality employees
ja_jp: 質の高い人材を惹きつけること、居続けてもらうこと

source: Automotive companies from the European Union
ja_jp: EU（欧州連合）の自動車メーカー

source: Back in 2012, the OSPO movement was still in its infancy, and Bloomberg had few examples of OSPOs outside large technology companies (and few official OSPOs even inside of tech companies). Kevin P. Fleming, the former head of technology community engagement at Bloomberg, told us, “During the year before I started at Bloomberg, there was an ongoing discussion between people in engineering about leveraging OSS and cloud infrastructure with the office of the CTO.
ja_jp: 2012年当時は OSPO の動きはまだ幼少期のものであり、Bloomberg には大手テック企業以外で OSPO の事例はほとんどありませんでした（そしてテック企業の中にさえ公式とよべるOSPOはほとんどありませんでした）。 Bloomberg テクノロジー コミュニティ エンゲージメントのトップを前任した Kevin P.Flemin はこう話してくれました。「私が Bloomberg に入社する前の年は、OSS とクラウドインフラを CTO オフィスで活用することについて、エンジニアリング部門の中で議論しているまっただ中でした。

source: Based on interviews we conducted for this paper, we have identified a handful of broad archetypes that drive differentiation in OSPO behavior.
ja_jp: 私たちは、実施したインタビューに基づき OSPO のふるまいに違いをもたらす「原型」を幾つか明確にしました。

source: Based on these interviews and the survey data, we mapped out a five-stage OSPO maturity model, from (1) using OSS coincidentally to (2) addressing compliance and license issues to (3) encouraging participation to (4) contributing code, and finally, to (5) incubating and open-sourcing meaningful projects.
ja_jp: 私たちは、これらのインタビューと調査データに基づき、次に示す5段階の「OSPO 成熟度モデル」にマッピングしました；(1)偶発的にOSS を使用している、(2)OSS の ライセンス準拠（コンプライアンス） とライセンスの課題に取り組んでいる、(3)オープンソースプロジェクトへの参画を促している、(4)さらにコントリビューションを促している、(5)そこからさらに意義のあるプロジェクトをインキュベートし、それをオープンソース化している。

source: Because major open source technology choices tend to generate significant secondary and tertiary costs and affect upstream and downstream technologies as well as hiring plans, the choice of open source projects becomes a major business decision.
ja_jp: 重大なオープンソース技術の選択は、著しい二次的、三次的コストを生じさせ、また上流および下流の技術や雇用計画にも影響を与える傾向があるため、オープンソース プロジェクトの選択は大きなビジネス上の意思決定となってきます。

source: Because these companies produce the same good that underpins the core of the open source movement, OSPOs at software companies tend to have slightly different characteristics.
ja_jp: これらの企業は、オープンソースが対象にしているのと同じもの（＝ソフトウェア）を作り出していることから、ソフトウェア企業の OSPO には若干異なる特徴があります。

source: Become a strategic partner for technology decisions, helping to guide choices and shape long-term commitments to projects
ja_jp: 技術的な意思決定のための戦略的パートナーとなり、選択の指針を示しプロジェクトへの長期的コミットメントを形成することを支援する

source: Beyond compliance, Porsche recognized that its future lay in embracing open source to more quickly iterate and innovate, and drive products to market faster.
ja_jp: コンプライアンスのその先には、より素早い開発のイテレーションやイノベーション、より迅速なマーケットへの製品創出を実現すべく、オープンソースを受け入れることに会社の未来がある、と Porsche は認識していました。

source: Beyond using open source in its products, Comcast contributes actively to, and sponsors, open source foundations and communities including the Linux Foundation, the OpenStack Foundation, the Apache Foundation, the Innersource Commons, and the Internet Engineering Task Force.
ja_jp: また Comcast は、自社製品にオープンソースを使用するだけでなく、Linux Foundation、OpenStack Foundation、Apache Foundation、Innersource Commons、Internet Engineering Task Force とったオープンソース財団やコミュニティに積極的なコントリビューションやスポンサリングを行っています。

source: Big Project Facilitators
ja_jp: ビッグプロジェクトのファシリテータ

source: Big Project Facilitators 20
ja_jp: ビッグプロジェクトのファシリテーター 20

source: Bloomberg began formally engaging with the open source community in 2012, and its involvement now includes hundreds of people across the company’s 6,500+ person global engineering workforce.
ja_jp: Bloomberg は2012年にオープンソース コミュニティとのエンゲージメントを公式に始め、現在では同社6,500人以上のグローバル エンジニアリング要員のうち数百人が参加しています。

source: Bloomberg began its OSPO journey in 2012, when engineering leadership realized that its engineers were consuming open source at a large scale inside of Bloomberg.
ja_jp: Bloomberg のOSPO の「旅」は2012年、当時同社エンジニアたちが自社内で大規模にオープンソースを使用（Consume）していることをエンジニアリングのリーダーたちが気付いたときから始まりました。

source: Bloomberg frequently uses OSS and contributes significant code to dozens of external open source projects.
ja_jp: また Bloomberg はOSSを高い頻度で使用しており、社外の数十ものオープンソース プロジェクトに対し重要な意味をもつコードを提供しています。

source: Bloomberg has incubated and released multiple open source projects into the community.
ja_jp: また、Bloomberg は複数のオープンソース プロジェクトをインキュベートし、コミュニティにリリースしてきました。

source: Bloomberg is a provider of data, news, and analytics to the world’s leading investors and financial services companies.
ja_jp: Bloomberg は、世界の先進的投資家や金融サービス企業向けのデータ、ニュース、分析を提供しています。

source: Bloomberg worked with Microsoft to make contributions to TypeScript
ja_jp: Bloomberg が Microsoft と連携して行った TypeScript へのコントリビューション

source: Bloomberg, for example, worked with Microsoft to make contributions to TypeScript (a JavaScript relative) and to create a better tooling structure that would allow Bloomberg engineers to contribute back code more easily.
ja_jp: 例えば、Bloomberg は Microsoft と協力して TypeScript（JavaScript とは親類関係にあたります）へのコントリビューションを行い、Bloomberg のエンジニアたちのコードの還元がしやすくなるように、より効果的なツール体系を作り上げました。

source: Bloomberg’s OSPO Journey
ja_jp: Bloomberg における OSPO ジャーニー

source: Bloomberg’s open source knowledge and practices to support the increasing number of engineers who are frequently participating in open source communities.
ja_jp: Bloomberg でオープンソース コミュニティに足繁く参加するエンジニアたちを増やしていくことの支援として、同社内のオープンソースに関する知識、プラクティスを広げていくことを計画しています。

source: Bloomberg’s open source philosophy also drove its sponsorship policies, underwriting or speaking at community-driven events, but not corporate events.
ja_jp: また、Bloomberg におけるオープンソースの企業哲学は、スポンサーシップのポリシーにも働きかけ、登壇スピーチや金銭的支援は、企業のイベントではなく、コミュニティ主導のイベントで行うことになるように推進しました。

source: Bloomberg’s technology leadership had also realized the strategic and business value of OSS and was planning to shift its software technology stack to emphasize open source over proprietary code.
ja_jp: また、同社の技術リーダーたちは OSS の戦略面およびビジネス面での価値を理解し、ソフトウェアの技術スタックをプロプライエタリなコードよりオープンソースに重きを置いたものへシフトしていくことを計画していきました。

source: By mapping conversations with OPSO leaders and experts to the OSPO survey results, we have developed an OSPO maturity model to describe the typical evolution of OSPOs.
ja_jp: そこで私たちは OPSO のリーダーたちや専門家たちとの対話を本サーベイの結果にマッピングすることで、OSPO の典型的な進化ステップを記述する、OSPO 成熟度モデルを開発しました。

source: CARIAD is closely involved with the OSPO efforts at Porsche and other Volkswagen Group companies.
ja_jp: CARIAD は、Porsche やその他 Volkswagen グループ企業における OSPO の取り組みに密接に関わっています。

source: Can you help make this happen?
ja_jp: これ、手伝ってくれないかな？

source: Chief Privacy Officer (CPO)
ja_jp: 最高プライバシー責任者（CPO）

source: Chris Aniszczyk, Chief Technology Officer, Linux Foundation, Co-Founder, TODO Group With a foreword by Jim Zemlin, Executive Director, The Linux Foundation
ja_jp: Chris Aniszczyk、The Linux Foundation チーフ テクノロジーオフィサー、および TODO グループ 共同創立者（序文：Jim Zemlin、The Linux Foundation エグゼクティブディレクター）

source: Chris Xie (Head of OSPO, Futurewei Technologies), Zoom interviews with author, Aug.
ja_jp: Chris Xie（Futurewei TechnologiesのOSPO責任者）、著者への Zoom インタビュー、
